{
  "_name_or_path": "albert-base-v2",
  "architectures": [
    "AlbertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0,
  "bos_token_id": 2,
  "classifier_dropout_prob": 0.1,
  "down_scale_factor": 1,
  "embedding_size": 128,
  "eos_token_id": 3,
  "gap_size": 0,
  "hidden_act": "gelu_new",
  "hidden_dropout_prob": 0,
  "hidden_size": 768,
  "id2label": {
    "0": "INTP",
    "1": "ISTP",
    "2": "ENTP",
    "3": "ESTP",
    "4": "INFP",
    "5": "ISFP",
    "6": "ENFP",
    "7": "ESFP",
    "8": "INTJ",
    "9": "ISTJ",
    "10": "ENTJ",
    "11": "ESTJ",
    "12": "INFJ",
    "13": "ISFJ",
    "14": "ENFJ",
    "15": "ESFJ"
  },
  "initializer_range": 0.02,
  "inner_group_num": 1,
  "intermediate_size": 3072,
  "label2id": {
    "INTP": 0,
    "ISTP": 1,
    "ENTJ": 10,
    "ESTJ": 11,
    "INFJ": 12,
    "ISFJ": 13,
    "ENFJ": 14,
    "ESFJ": 15,
    "ENTP": 2,
    "ESTP": 3,
    "INFP": 4,
    "ISFP": 5,
    "ENFP": 6,
    "ESFP": 7,
    "INTJ": 8,
    "ISTJ": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "albert",
  "net_structure_type": 0,
  "num_attention_heads": 12,
  "num_hidden_groups": 1,
  "num_hidden_layers": 12,
  "num_memory_blocks": 0,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.26.1",
  "type_vocab_size": 2,
  "vocab_size": 30000
}
